Repository: giant35/quarkusZH
Catalog: l10n/tmx/zh_CN/quarkus.tmx
Source language: en
Languages: zh_cn

source: Prerequisites
zh_cn: 准备

source: To complete this guide, you need:
zh_cn: 要完成本指南，您需要：

source: an IDE
zh_cn: IDE

source: Architecture
zh_cn: 架构

source: Solution
zh_cn: 完整源码

source: Container First
zh_cn: 容器优先

source: Developer Joy
zh_cn: 开发乐趣

source: the Maven structure
zh_cn: Maven 目录结构

source: Using our Tooling
zh_cn: 工具使用

source: Getting Started
zh_cn: 入门

source: Documentation
zh_cn: 文档

source: Running the application
zh_cn: 运行应用

source: Once started, you can request the provided endpoint:
zh_cn: 启动后，可以请求提供的接口：

# Automatically add newline with `curl -w " "`
source: Automatically add newline with `curl -w "\n"`
zh_cn: 用 `curl -w "\n"` 自动添加换行

source: We are using `curl -w "\n"` in this example to avoid your terminal printing a '%' or put both result and next command prompt on the same line.
zh_cn: 在本例中，我们使用 `curl -w "\n"` 来避免终端输出 ‘%’ ，或者将结果和下一个命令提示符放在同一行。

source: Using injection
zh_cn: 使用注入

source: ArC comes as a dependency of `quarkus-resteasy` so you already have it handy.
zh_cn: ArC 是 `quarkus-resteasy` 的一个依赖项，所以可以直接使用 。

source: Learn how to create a Hello World Quarkus app. This guide covers:
zh_cn: 了解如何创建Quarkus Hello World 应用程序。 本指南涵盖:

source: Bootstrapping an application
zh_cn: 搭建应用程序

source: Creating a JAX-RS endpoint
zh_cn: 创建JAX-RS 接口

source: Injecting beans
zh_cn: 注入beans

source: Functional tests
zh_cn: 功能测试

source: Packaging of the application
zh_cn: 应用打包

source: Verify Maven is using the Java you expect
zh_cn: 验证 Maven 是否使用了预期的Java

source: If you have multiple JDK's installed it is not certain Maven will pick up the expected java and you could end up with unexpected results. You can verify which JDK Maven uses by running `mvn --version`.
zh_cn: 如果您安装了多个JDK，Maven可能未使用预期的java，这样可能会得到意外的结果。您可以通过运行​ `mvn —version` 来验证 Maven 使用了哪个JDK。

source: In this guide, we create a straightforward application serving a `hello` endpoint. To demonstrate dependency injection, this endpoint uses a `greeting` bean.
zh_cn: 在本指南中，我们将创建一个提供 `hello` 接口的简单应用程序。为了演示依赖注入，这个接口使用一个 `greeting` bean。

source: This guide also covers the testing of the endpoint.
zh_cn: 本指南还包括接口的测试。

source: We recommend that you follow the instructions from <<bootstrapping-the-project,Bootstrapping project>> and onwards to create the application step by step.
zh_cn: 建议您按照后续说明从 <<bootstrapping-the-project,Bootstrapping project>> 逐步创建应用程序。

source: However, you can go right to the completed example.
zh_cn: 当然您也可以直接查看完成后的代码。

source: Download an {quickstarts-archive-url}[archive] or clone the git repository:
zh_cn: 下载 {quickstarts-archive-url}[压缩包] 或克隆 git 仓库:

source: The solution is located in the `getting-started` {quickstarts-tree-url}/getting-started[directory].
zh_cn: 代码位于 `getting-started` {quickstarts-tree-url}/getting-started[目录] 中.

source: Bootstrapping the project
zh_cn: 搭建项目

source: The easiest way to create a new Quarkus project is to open a terminal and run the following command:
zh_cn: 创建 Quarkus 项目最简单方法是打开命令行并运行以下命令：

source: If using cmd , (don't use backward slash `\`)
zh_cn: 如果使用cmd，（不要使用反斜杠 `\` )

source: If using Powershell , wrap `-D` parameters in double quotes
zh_cn: 如果使用Powershell，请用双引号将 `-D` 参数括起来

source: It generates the following in `./getting-started`:
zh_cn: 上边命令会在 `./getting-started` 中生成：

source: an `org.acme.getting.started.GreetingResource` resource exposed on `/hello`
zh_cn: `org.acme.getting.started.GreetingResource` 提供接口 `/hello`

source: a landing page that is accessible on `http://localhost:8080` after starting the application
zh_cn: 启动应用程序后可访问 `http://localhost:8080` 入口页

source: example `Dockerfile` files for both `native` and `jvm` modes in `src/main/docker`
zh_cn: `src/main/docker` 有 `Dockerfile` 样例文件, 包含 `native` 及 `jvm` 模式

source: Once generated, look at the `pom.xml`. You will find the import of the Quarkus BOM, allowing you to omit the version on the different Quarkus dependencies. In addition, you can see the `quarkus-maven-plugin` responsible of the packaging of the application and also providing the development mode.
zh_cn: 生成后，查看 `pom.xml` 。 您会看到导入了 Quarkus BOM ，让您不用关心 Quarkus 依赖项版本。 此外，您还可以看到负责打包应用程序并提供开发模式的 `quarkus-maven-plugin` 。

source: If we focus on the dependencies section, you can see the extension allowing the development of REST applications:
zh_cn: 如果我们关注 dependencies 部分，您可以看到用于支持 REST 程序开发的扩展：

source: During the project creation, the `src/main/java/org/acme/getting/started/GreetingResource.java` file has been created with the following content:
zh_cn: 项目创建生成时，已经创建了`src/main/java/org/acme/getting/started/GreetingResource.java` 文件，其中包含以下内容：

source: It's a very simple REST endpoint, returning "hello" to requests on "/hello".
zh_cn: 这是一个非常简单的REST 接口，请求 “/hello” 时返回 “hello” 。

source: Differences with vanilla JAX-RS
zh_cn: 与普通 JAX-RS 的差别

source: With Quarkus, there is no need to create an `Application` class. It's supported, but not required. In addition, only one instance of the resource is created and not one per request. You can configure this using the different `*Scoped` annotations (`ApplicationScoped`, `RequestScoped`, etc).
zh_cn: 使用 Quarkus，不需要创建 `Application` 类。能用它，但不是必需的。此外，只创建资源类的一个实例，而不是每次请求创建一个实例。(QFY: GreetingResource 是单例)您可以使用不同的 `*Scoped` 注解 (`ApplicationScoped`, `RequestScoped` ，等）对它进行配置。

source: Now we are ready to run our application. Use: `./mvnw compile quarkus:dev`:
zh_cn: 现在我们可以运行应用程序了。 使用:`./mvnw compile quarkus:dev`:

source: Hit `CTRL+C` to stop the application, or keep it running and enjoy the blazing fast hot-reload.
zh_cn: 按 CTRL+C 停止应用程序，或者让它继续运行并享受超快的热加载。

source: Dependency injection in Quarkus is based on ArC which is a CDI-based dependency injection solution tailored for Quarkus' architecture. If you're new to CDI then we recommend you to read the link:cdi[Introduction to CDI] guide.
zh_cn: Quarkus 中的依赖注入是基于ArC的，ArC是一个基于 CDI 的依赖注入解决方案，专为 Quarkus 设计。 如果你之前未使用过 CDI 建议你参考下 link:cdi[ 上下文依赖介绍] 。

source: Let's modify the application and add a companion bean. Create the `src/main/java/org/acme/getting/started/GreetingService.java` file with the following content:
zh_cn: 让我们修改应用程序并添加一个辅助 bean。 创建 `src/main/java/org/acme/getting/started/GreetingService.java` 文件包含以下内容:

source: Edit the `GreetingResource` class to inject the `GreetingService` and create a new endpoint using it:
zh_cn: 编辑 `GreetingResource` 类注入 `GreetingService` 并在一个新接口中使用它:

source: If you stopped the application, restart the application with `./mvnw compile quarkus:dev`. Then check that the endpoint returns `hello quarkus` as expected:
zh_cn: 如果已经停止应用程序，请使用 `./mvnw compile quarkus:dev` 重新启动应用程序，然后检查接口是否返回期望的 `hello quarkus` ：

source: Contributing
zh_cn: 贡献

source: Unified configuration
zh_cn: 统一配置

source: Getting Started with Reactive
zh_cn: 响应式入门

source: Building Native Executables
zh_cn: 构建原生执行程序

source: Quarkus 2.0 continues the mission of making Java the preferred framework for Kubernetes-native development with new developer tools and improved performance.
zh_cn: Quarkus 2.0 继续执行使命，即通过新的开发人员工具和改进的性能，使 Java 成为 Kubernetes 原生开发的首选框架。

source: Quickly Bootstrap Your Application
zh_cn: 应用快速开始

source: Feedback and Help
zh_cn: 反馈和帮助

source: For usage questions, we recommend to:
zh_cn: 对于使用问题，我们建议：

source: Ask on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow with the <code>quarkus</code> tag</a>
zh_cn: 在 <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow 带上 <code>quarkus</code> 标签</a> 提问

source: For questions related to the development of Quarkus:
zh_cn: 对于 Quarkus 开发相关问题：

source: The <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>
zh_cn: <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>

source: Chat using <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)
zh_cn: 用 <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> 交流 (<code>#dev</code> stream)

source: Your help is more than welcome! Don’t hesitate to join the crowd.
zh_cn: 欢迎你的帮助！来吧不要犹豫。

source: Join the Quarkus Community
zh_cn: 加入 Quarkus 社区

source: Check out our <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> for details on reporting issues and the process for submitting pull requests.
zh_cn: 报告问题及处理 pul request 的详细信息请查看 <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> .

source: Every contribution is valuable. It can be a bug report, an example application, a feature request, a fix in the documentation or just feedback.
zh_cn: 任何贡献都是有价值的。比如提交一个 bug 、写个示例代码、功能提议、文档修正或只是反馈。

source: Quarkus is an Open Source project licensed under the <a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a>. First and foremost, it is an open community where contributions, ideas and discussions are done in the open and contributors are welcome. Let’s join forces in building the future of Java applications.
zh_cn: Quarkus 是一个开源项目，使用 <a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a> 许可协议. 最重要的是这是一个开放的社区，欢迎贡献者公开进行贡献、想法和讨论。让我们一起来构建 Java 应用的未来。

source: Roadmap
zh_cn: 路线图

source: Read about the community plans for the future. Here is <a href="https://github.com/orgs/quarkusio/projects/5">our current roadmap</a>. This is driven by the community, come and tell us what <i>your</i> needs are.
zh_cn: 了解社区未来计划. 这是 <a href="https://github.com/orgs/quarkusio/projects/5">我们当前的路线图</a>. 这是由社区驱动的，来吧告诉我们什么是 <i>你</i> 想要的.

source: Code and Issue Tracker
zh_cn: 代码及问题跟踪

source: The source code is hosted on <a href="https://github.com/quarkusio/quarkus">GitHub</a>. If you need to report a bug or request a new feature, look for a similar one on our <a href="https://github.com/quarkusio/quarkus/issues">GitHub issue tracker</a>. If you don’t find any, <a href="https://github.com/quarkusio/quarkus/issues/new/choose">create a new issue</a>.
zh_cn: 源代码托管在 <a href="https://github.com/quarkusio/quarkus">GitHub</a>. 如果需要提交 bug 或者提交功能建议，先在 <a href="https://github.com/quarkusio/quarkus/issues">GitHub issue tracker</a>找找看有没类似的. 没有的话, <a href="https://github.com/quarkusio/quarkus/issues/new/choose">创建一个新的 issue</a>.

source: Write QuickStart Guides
zh_cn: 编写快速开始指南

source: There are always new users trying to get started quickly. Share your experience with everyone by writing a Quickstart and submitting it for peer review.
zh_cn: 总有一些新用户试图快速入门。通过写一个快速入门与大家分享你的经验并提交给同行评审。

source: Write New Extensions
zh_cn: 写新的 Extensions

source: Follow Quarkus on Twitter
zh_cn: 关注 Quarkus Twitter

source: A Kubernetes Native Java stack tailored for OpenJDK HotSpot and GraalVM, crafted from the best of breed Java libraries and standards.
zh_cn: 专为 OpenJDK HotSpot 及 GraalVM 量身定制的原生 Kubernetes Java 开发栈，采用最佳 Java 库和标准精制而成。

source: <a href="{{site.baseurl}}/get-started/" class="button-cta">Get Started with Quarkus</a>
zh_cn: <a href=“{{site.baseurl}}/get-started/“ class=“button-cta”>Quarkus 入门</a>

source: Now Available
zh_cn: 现可用

source: <a href="{{ site.data.versions.quarkus.announce }}">More Information</a>
zh_cn: <a href=“{{ site.data.versions.quarkus.announce }}”>更多信息</a>

source: Best of Breed Libraries and Standards
zh_cn: 优秀的类库及标准件

source: You need <a href="https://en.wikipedia.org/wiki/Comparison_of_integrated_development_environments#Java" target="_blank">an IDE</a> like <a href="https://www.jetbrains.com/idea/download/">IntelliJ IDEA</a>, <a href="https://www.eclipse.org/downloads/">Eclipse</a>, <a href="https://code.visualstudio.com/Download">VSCode</a> or even <a href="https://spacevim.org/use-vim-as-a-java-ide/">Vim</a> or <a href="http://spacemacs.org">Emacs</a>!
zh_cn: 你需要一个 <a href=“https://en.wikipedia.org/wiki/Comparison_of_integrated_development_environments#Java” target=“_blank”> IDE</a> 如 <a href=“https://www.jetbrains.com/idea/download/“>IntelliJ IDEA</a>, <a href=“https://www.eclipse.org/downloads/“>Eclipse</a>, <a href=“https://code.visualstudio.com/Download”>VSCode</a> 或者 <a href=“https://spacevim.org/use-vim-as-a-java-ide/“>Vim</a> 、 <a href=“http://spacemacs.org”>Emacs</a>!

source: You need a <a href="https://adoptopenjdk.net" target="_blank">a JDK {{ site.data.versions.jdk }}</a> (any distribution)
zh_cn: 你需要 <a href=“https://adoptopenjdk.net” target=“_blank”> JDK {{ site.data.versions.jdk }}</a> (any distribution)

source: Optionally get <a href="https://www.graalvm.org/" target="_blank">GraalVM</a> {{ site.data.versions.graalvm }} for native compilation
zh_cn: 可选项 <a href=“https://www.graalvm.org/“ target=“_blank”>GraalVM</a> {{ site.data.versions.graalvm }} 用于原生编译

source: You need <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a>
zh_cn: 你需要 <a href=“https://maven.apache.org/“ target=“_blank”>Apache Maven {{ site.data.versions.maven }}</a>

source: or <a href="https://gradle.org/" target="_blank">Gradle</a>
zh_cn: 或 <a href=“https://gradle.org/“ target=“_blank”>Gradle</a>

source: <a href="https://code.quarkus.io">Start Coding</a> with Quarkus {{ site.data.versions.quarkus.version }} [<a href="{{ site.data.versions.quarkus.announce }}">announce</a>|<a href="https://github.com/quarkusio/quarkus/releases/tag/{{ site.data.versions.quarkus.version }}">changelog</a>]
zh_cn: <a href=“https://code.quarkus.io”>开始编码</a> 用 Quarkus {{ site.data.versions.quarkus.version }} [<a href=“{{ site.data.versions.quarkus.announce }}”>announce</a>|<a href=“https://github.com/quarkusio/quarkus/releases/tag/{{ site.data.versions.quarkus.version }}”>changelog</a>]

source: Need More Than Community Support?
zh_cn: 需要社区外的支持？

source: If you require a higher level of support, you have options.
zh_cn: 如果你需要更高级的支持，有一些选择。

source: Enterprise support provided by Red Hat for the product.
zh_cn: Red Hat 为产品提供的企业支持。

source: Quarkus tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot. <a href="/vision/container-first">Learn more.</a>
zh_cn: Quarkus 为 GraalVM 和 HotSpot 量身定制用程序。启动超快，内存极低（不仅是堆大小！）在容器编排平台（如Kubernetes）中提供了近乎即时的向上扩展和高密度的内存利用率。我们使用一种称为编译时启动技术。 <a href="/vision/container-first">了解更多</a>

source: A cohesive platform for optimized developer joy:
zh_cn: 一个让开发者更开心的平台:

source: Zero config, live reload in the blink of an eye
zh_cn: 零配置，瞬间重新加载

source: No hassle native executable generation
zh_cn: 简单生成可执行文件

source: <a href="/vision/developer-joy">Learn more</a>
zh_cn: <a href="/vision/developer-joy">了解更多</a>

source: QUARKUS 2.0 IS HERE!
zh_cn: QUARKUS 2.0 来了！

source: Getting Help from the Community
zh_cn: 获取社区帮助

source: We have a lot of documentation. Be sure to check our <a href="{{site.baseurl}}/get-started/">Getting started page</a>, and all our <a href="{{site.baseurl}}/guides/">guides</a>. Also check out our <a href="{{site.baseurl}}/faq/">FAQ section</a> and <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">Quarkus Tips Playlist</a>
zh_cn: 我们有很多文档. 看下<a href="{{site.baseurl}}/get-started/">入门</a>, 还有所有 <a href="{{site.baseurl}}/guides/">指南</a>. 还可以看下 <a href="{{site.baseurl}}/faq/">FAQ</a> 及 <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">Quarkus Tips Playlist</a>

source: Ask your questions on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow</a>. After the documentation, it’s probably the best place to look for answers. We actively monitor the <a href="https://stackoverflow.com/questions/tagged/quarkus">Quarkus tag</a>.
zh_cn: 在 <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow</a> 提问. 除本文档外，那里可能是寻找答案的最佳地点. 我们会关注 <a href="https://stackoverflow.com/questions/tagged/quarkus">Quarkus tag</a>.

source: Get Started
zh_cn: 入门
